app/controllers/static_pages_controller.rb

  def home
    if signed_in?
      @micropost = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
SELECT COUNT(*) FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships